#language:ru

###Функционал: Поиск описаня в гугл
  #Сценарий: Найти информацию Iphone X

  #  Пусть совершен переход на страницу "Страница поиска гугл" по ссылке из property файла "Googlepage"
  #  И страница "Страница поиска гугл" загрузилась
  #  Тогда в поле "Поиск" введено значение "Iphone X"
  #  И выполнено нажатие на кнопку "Найти"
  #  Если поле "Описание товара" содержит значение "www.apple.com/ru"
  #  Тогда выполнено нажатие на блок "Описание товара2"
 #   И элементы списка "<string>" содержат текст "<string>"
#    выполнено ожидание в течение 3 секунд
